import streamlit as st
import pandas as pd
import numpy as np

st.title('南宁美食数据仪表')

# 定义数据,以便创建数据框
data = {
    '月份':['01月', '02月', '03月','04月', '05月', '06月','07月', '08月', '09月','10月', '11月', '12月'],
    '1号门店':[200, 150, 180,120, 160, 123,150, 100, 220,110, 100, 160],
    '2号门店':[120, 160, 123,150, 100, 220,110, 100, 160,150,130,125],
    '3号门店':[110, 100, 160,120, 160, 123,60,123,114,125,145,87],
    '4号门店':[90, 99, 110,150, 100, 220,110,130,160,99,100,160],
    '5号门店':[150, 100, 220,120, 160, 123,110, 100, 160,160,112,124],
}

# 根据上面创建的data，创建数据框
df = pd.DataFrame(data)

# 定义数据框所用的新索引
index = pd.Series([1, 2, 3,4,5,6,7,8,9,10,11,12], name='序号')
# 将新索引应用到数据框上
df.index = index

st.header("门店数据")
# 使用write()方法展示数据框
st.write(df)
st.header("折线图")

# 通过x指定月份所在这一列为折线图的x轴
st.line_chart(df, x='月份')


# 修改df，用月份列作为df的索引，替换原有的索引
df.set_index('月份', inplace=True)

map_data={
    "latitude": [22.853838, 22.965046, 22.812200, 22.809105, 22.839699],
    "longitude": [108.222177, 108.353921, 108.266629, 108.378664, 108.245804]
}

mapd=pd.DataFrame(map_data)

st.map(mapd)

st.header("餐厅评分")

fen_data={
    "餐厅": ["星艺会尝不忘", "高峰柠檬鸭", "复记老友粉", "好友缘", "西冷牛排店"],
     "评分": [4.2, 4.5, 4.0, 4.7, 4.3]
}
# 根据上面创建的data，创建数据框
df1 = pd.DataFrame(fen_data)
# 定义数据框所用的新索引
index = pd.Series([1, 2, 3,4,5], name='评分')
# 将新索引应用到数据框上
df1.index = index

# 通过x指定月份所在这一列为条形图的x轴
st.bar_chart(df1, x='餐厅')

st.header("用餐高峰")

#用餐高峰
can_data = {
    "餐厅": ["星艺会尝不忘", "高峰柠檬鸭", "复记老友粉", "好友缘", "西冷牛排店"],
    '12点':[200, 150, 180,90, 160],
    '13点':[100, 140, 110,150, 180],
    '14点':[220, 170, 160,140, 110],
    '15点':[230, 120, 190,110,150],
    '16点':[150, 90, 130,110,150],
    '17点':[120, 130, 150,90, 160],
    '18点':[110, 50, 110,150, 180,],
    '19点':[90, 160, 120,140, 110]
}
# 根据上面创建的data，创建数据框
df2 = pd.DataFrame(can_data)
# 定义数据框所用的新索引
index = pd.Series([1, 2, 3,4,5], name='12点')
# 将新索引应用到数据框上
df2.index = index

# 通过x指定月份所在这一列为面积图的x轴
st.area_chart(df2, x='餐厅')




